src/Catalogs/Scan_Компании/Scan_Компании.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Scan_Компании</name>
  <predefined>
    <items>
      <name>СканияРусь</name>
      <description>Скания Русь</description>
    </items>
  </predefined>
  <attributes>
    <name>DealerID_COW</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IDExternalSystem</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидДилера</name>
    <type>
      <types>EnumRef.Scan_ВидыДилеров</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппыКомпаний</name>
    <type>
      <types>CatalogRef.Scan_ГруппыКомпаний</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбновления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Дилер</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДилерАктивен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодДилера</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодДилераSOWA</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Scan_Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеАнглийское</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПриоритетныйСклад</name>
    <type>
      <types>CatalogRef.Scan_МестаХранения</types>
      <types>CatalogRef.Scan_Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусыКомпаний</name>
    <type>
      <types>CatalogRef.Scan_СтатусыКомпаний</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипыДилеров</name>
    <type>
      <types>CatalogRef.Scan_ТипыДилеров</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормыКомпаний</name>
    <type>
      <types>CatalogRef.Scan_ФормыКомпаний</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РегионыОтветственности</name>
    <attributes>
      <name>Регион</name>
      <type>
        <types>CatalogRef.Scan_Регионы</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДоступныеМаркиДилера</name>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Марка</name>
      <type>
        <types>CatalogRef.Scan_МаркиПродуктов</types>
      </type>
    </attributes>
    <attributes>
      <name>Автор</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/InformationRegisters/Scan_ИсторияКомпаний/Scan_ИсторияКомпаний.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Scan_ИсторияКомпаний</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Значение</name>
    <type>
      <types>EnumRef.Scan_ВидыДилеров</types>
      <types>CatalogRef.Scan_СтатусыКомпаний</types>
      <types>Boolean</types>
      <types>CatalogRef.Scan_Контрагенты</types>
      <types>CatalogRef.Scan_ГруппыКомпаний</types>
      <types>String</types>
      <types>CatalogRef.Scan_ФормыКомпаний</types>
      <types>CatalogRef.Scan_ТипыДилеров</types>
      <types>Date</types>
      <types>Number</types>
      <types>CatalogRef.Scan_МестаХранения</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Компания</name>
    <type>
      <types>CatalogRef.Scan_Компании</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидЗначения</name>
    <type>
      <types>EnumRef.Scan_ДополнительнаяИнформацияПоКомпаниям</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/Scan_ДополнительнаяИнформацияПоКомпаниям/Scan_ДополнительнаяИнформацияПоКомпаниям.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Scan_ДополнительнаяИнформацияПоКомпаниям</name>
  <enumValues>
    <name>IDExternalSystem</name>
  </enumValues>
  <enumValues>
    <name>ДатаОбновления</name>
  </enumValues>
  <enumValues>
    <name>Контрагент</name>
  </enumValues>
  <enumValues>
    <name>КодДилера</name>
  </enumValues>
  <enumValues>
    <name>КодДилераSOWA</name>
  </enumValues>
  <enumValues>
    <name>НаименованиеАнглийское</name>
  </enumValues>
  <enumValues>
    <name>ГруппыКомпаний</name>
  </enumValues>
  <enumValues>
    <name>СтатусыКомпаний</name>
  </enumValues>
  <enumValues>
    <name>ФормыКомпаний</name>
  </enumValues>
  <enumValues>
    <name>ТипыДилеров</name>
  </enumValues>
  <enumValues>
    <name>ВидДилера</name>
  </enumValues>
  <enumValues>
    <name>DealerID_COW</name>
  </enumValues>
  <enumValues>
    <name>ПриоритетныйСклад</name>
  </enumValues>
  <enumValues>
    <name>Дилер</name>
  </enumValues>
  <enumValues>
    <name>Наименование</name>
  </enumValues>
  <enumValues>
    <name>ДилерАктивен</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/Scan_Компании/ObjectModule.bsl
Перем ИзмРекв; //rarus vikhle 15.06.2020 mt 15888

//rarus tenkam 23.06.2016 mantis 6897 ++
Процедура ПередЗаписью(Отказ)
	//rarus vikhle 15.06.2020 mt 15888 +++
	ИзмРекв = Новый Массив;
	//для нового запишем в регистр заполненные реквизиты
	Если ЭтотОбъект.ЭтоНовый() тогда
		Для каждого Реквизит из ЭтотОбъект.Метаданные().Реквизиты Цикл
			Если ТипЗнч(ЭтотОбъект[Реквизит.Имя]) = Тип("Булево") и ЭтотОбъект[Реквизит.Имя] = Ложь Тогда
				Продолжить;
			ИначеЕсли Не ЗначениеЗаполнено(ЭтотОбъект[Реквизит.Имя]) Тогда
				Продолжить;
			КонецЕсли;
			ИзмРекв.Добавить(Реквизит.Имя);
		КонецЦикла;
		ИзмРекв.Добавить("Наименование");
	Иначе  //если не новый - то измененные
		Для каждого Реквизит из ЭтотОбъект.Метаданные().Реквизиты Цикл
			Если (ЭтотОбъект[Реквизит.Имя] <> Ссылка[Реквизит.Имя]) Тогда
				ИзмРекв.Добавить(Реквизит.Имя);
			КонецЕсли;
		КонецЦикла;
		Если ЭтотОбъект.Наименование <> Ссылка.Наименование Тогда
			ИзмРекв.Добавить("Наименование");
		КонецЕсли;
	КонецЕсли;
	//для старых объектов, у которых нет данных в регистре - запишем заполненные
	Если ИзмРекв.Количество() = 0 И НетИсторииВРегистре(Ссылка) Тогда
		Для каждого Реквизит из ЭтотОбъект.Метаданные().Реквизиты Цикл
			Если ТипЗнч(ЭтотОбъект[Реквизит.Имя]) = Тип("Булево") и ЭтотОбъект[Реквизит.Имя] = Ложь Тогда
				Продолжить;
			ИначеЕсли Не ЗначениеЗаполнено(ЭтотОбъект[Реквизит.Имя]) Тогда
				Продолжить;
			КонецЕсли;
			ИзмРекв.Добавить(Реквизит.Имя);
		КонецЦикла;
		ИзмРекв.Добавить("Наименование");
	КонецЕсли;
	//rarus vikhle 15.06.2020 mt 15888 ---
		
	
	//rarus sergei 09.11.2016 mantis 7163 ++
	ЭтотОбъект.ДополнительныеСвойства.Вставить("ЭтоНовый", ?(ЭтотОбъект.ЭтоНовый(), ИСТИНА, ЛОЖЬ));
	//rarus sergei 09.11.2016 mantis 7163 --
	Если Дилер И НЕ ПометкаУдаления //rarus bonmak 08.06.2020 16178 добавил условие
		И ЗначениеЗаполнено(КодДилера)//rarus agar 08.02.2021 17203 +-
		Тогда
		ОтборСтруктура = Новый Структура("КодДилера", КодДилера); 		
		
		Выборка = Справочники.Scan_Компании.Выбрать(,,ОтборСтруктура); //rarus bonmak 04.12.2019 14456
		
		Пока Выборка.Следующий() Цикл
			Если Выборка.Ссылка = Ссылка Тогда
				Продолжить;
			КонецЕсли;
			Сообщение = Новый СообщениеПользователю;
			//rarus FominskiyAS 24.04.2019  mantis 14191 +++
			//Сообщение.Текст = "Дилер с таким кодом уже существует!";
			Сообщение.Текст = НСтр("ru = 'Дилер с таким кодом уже существует!'; en = 'Dealer with this code already exists!'");
			//rarus FominskiyAS 24.04.2019  mantis 14191 ---  
			Сообщение.Сообщить();
			ЗаписьЖурналаРегистрации("Ошибка справочника", УровеньЖурналаРегистрации.Ошибка,, Ссылка, Сообщение.Текст); //rarus bonmak 20.12.2019 15531
			Отказ = Истина;
			Возврат;
		КонецЦикла;
	КонецЕсли;
	
	//rarus vikhle 14.02.2023 m 19839 +++
	Если Дилер Тогда
		Для Каждого СтрокаТЧ ИЗ ДоступныеМаркиДилера Цикл
			
			Если НЕ ЗначениеЗаполнено(СтрокаТЧ.Марка) Тогда
				ТекстОшибки = СтрШаблон(Нстр("ru = 'Не заполнена колонка ""Марка"" в строке № %1 табличной части ""ДоступныеМаркиДилера""'"), СтрокаТЧ.НомерСтроки);
				ОбщегоНазначения.СообщитьПользователю(ТекстОшибки,,,, Отказ);
				Продолжить;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(СтрокаТЧ.Период) Тогда
				СтрокаТЧ.Период = ТекущаяДатаСеанса();	
			КонецЕсли;	
			
			Если НЕ ЗначениеЗаполнено(СтрокаТЧ.Автор) Тогда
				СтрокаТЧ.Автор = Пользователи.ТекущийПользователь();	
			КонецЕсли;
			
		КонецЦикла;	
	КонецЕсли;	
	//rarus vikhle 14.02.2023 m 19839 ---
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	//rarus bonmak 15.04.2020 14456 ++
	//Если ЗначениеЗаполнено(Контрагент) Тогда
	//	НаДату = ТекущаяДата();
	//	Справочники.Scan_Компании.ЗаписьЗначенияРегистраСведения(Ссылка, Контрагент, НаДату); //rarus bonmak 04.12.2019 14456
	//КонецЕсли;
	//rarus bonmak 15.04.2020 14456 --
	
	//rarus vikhle 15.06.2020 mt 15888 +++
	Для Каждого Реквизит из	ИзмРекв Цикл
		ВидЗначения = Перечисления.Scan_ДополнительнаяИнформацияПоКомпаниям[Реквизит];
		РегистрыСведений.Scan_ИсторияКомпаний.ЗаписьЗначенияРегистраСведенийИсторияКомпаний(Ссылка,Ссылка[Реквизит],ВидЗначения,ТекущаяДатаСеанса());
	КонецЦикла;
	////rarus vikhle 15.06.2020 mt 15888 ---
	
КонецПроцедуры
//rarus tenkam 18.10.2016 mantis 6897 --

//rarus vikhle 15.06.2020 mt 15888 +++
Функция НетИсторииВРегистре(Компания)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Компания",Компания);
	Запрос.Текст = "ВЫБРАТЬ
	               |	Scan_ИсторияКомпаний.Значение КАК Значение
	               |ИЗ
	               |	РегистрСведений.Scan_ИсторияКомпаний КАК Scan_ИсторияКомпаний
	               |ГДЕ
	               |	Scan_ИсторияКомпаний.Компания = &Компания";
	Возврат Запрос.Выполнить().Выбрать().Количество() = 0;	
КонецФункции
//rarus vikhle 15.06.2020 mt 15888 ---
